Revit 2017 API
IExportContext.OnRPC Method
 This method marks the beginning of export of an RPC object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
void OnRPC(
	RPCNode node
)
Visual Basic
Sub OnRPC ( _
	node As RPCNode _
)
Visual C++
void OnRPC(
	RPCNode^ node
)
Parameters
node
Type: Autodesk.Revit.DB.RPCNode
 A node with asset information about the RPC object.
See Also
IExportContext Interface
Autodesk.Revit.DB Namespace